app/controllers/usercodes_controller.rb

  def index
    @usercodes = Usercode.all
---
SELECT  "usercodes".* FROM "usercodes" WHERE "usercodes"."user_id" = ? LIMIT 1  [["user_id", 3]]

  def create
    @usercode = Usercode.new(code: params[:code], user_id: session[:user_id])
    puts @usercode
    respond_to do |format|
      if @usercode.save
---
INSERT INTO "usercodes" ("code", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["code", "  \n  function hello(x){\n    \n    \n  }"], ["user_id", 3], ["created_at", "2015-12-11 18:02:39.750968"], ["updated_at", "2015-12-11 18:02:39.750968"]]

    def set_usercode
      @usercode = Usercode.find(params[:id])
---
SELECT  "usercodes".* FROM "usercodes" WHERE "usercodes"."id" = ? LIMIT 1  [["id", 1]]