app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "patients".* FROM "patients" WHERE "patients"."surgeon" = ? LIMIT 1  [["surgeon", "1"]]
---
  def show
    if "#{params[:id]}" == "#{session[:user_id]}"
      @user = User.find(params[:id])
      #find all patients that are associated with this surgeon
      @patient = Patient.new
      @current_patients = []
      @current_patients += Patient.where(surgeon: params[:id]).to_a if Patient.find_by(surgeon: params[:id])